In [23]:
import numpy as np
import pandas as pd 

kulfi=['choclate ','mango','mango','vanilla','kesar']
a=pd.Series(kulfi)

In [7]:
lottery=[1,2,3,4,5]
pd.Series(lottery)

0    1.4
1    2.0
2    3.0
3    4.0
4    5.0
dtype: float64

In [9]:
reg=[True,False,True]

pd.Series(reg)

0     True
1    False
2     True
dtype: bool

In [26]:
#Attributes

import pandas as pd


kaushal=['smart','handsome','charming','brilliant','humble','pro']

good_person=pd.Series(kaushal)

good_person

0        smart
1     handsome
2     charming
3    brilliant
4       humble
5          pro
dtype: object

In [19]:
#########################################atributes ####################################
good_person.values

array(['smart', 'handsome', 'charming', 'brilliant', 'humble', 'pro'],
      dtype=object)

In [20]:
good_person.index

RangeIndex(start=0, stop=6, step=1)

In [25]:
good_person.dtype

dtype('O')

In [ ]:
########################################   methods #################################

In [76]:
rate=[500,500,540,300,400,220,800]

r=pd.Series(rate)
r

0    500
1    500
2    540
3    300
4    400
5    220
6    800
dtype: int64

In [30]:
r.sum()

3260

In [37]:
r.mean()

465.7142857142857

In [77]:
r.count()

7

In [38]:
r.idxmax()

6

In [40]:
fruits=['apple','mango','orange','grapes','banana']
weekdays=['mon','tue','wed','thur','fri']
pd.Series(fruits,weekdays)

mon      apple
tue      mango
wed     orange
thur    grapes
fri     banana
dtype: object

In [ ]:
##################################### Read CSV files ########################################################

In [4]:
import pandas as pd

p=pd.read_csv('weather_data.csv')

p.head()  # starting first 5 records

        day  temperature  windspeed  event
0  1/1/2017         32.0        6.0   Rain
1  1/4/2017          NaN        9.0  Sunny
2  1/5/2017         28.0        NaN   Snow
3  1/6/2017          NaN        7.0    NaN
4  1/7/2017         32.0        NaN   Rain

In [51]:
p.head(7)

        day  temperature  windspeed  event
0  1/1/2017         32.0        6.0   Rain
1  1/4/2017          NaN        9.0  Sunny
2  1/5/2017         28.0        NaN   Snow
3  1/6/2017          NaN        7.0    NaN
4  1/7/2017         32.0        NaN   Rain
5  1/8/2017          NaN        NaN  Sunny
6  1/9/2017          NaN        NaN    NaN

In [53]:
p.tail(3)

         day  temperature  windspeed   event
6   1/9/2017          NaN        NaN     NaN
7  1/10/2017         34.0        8.0  Cloudy
8  1/11/2017         40.0       12.0   Sunny

In [54]:
p.values

array([['1/1/2017', 32.0, 6.0, 'Rain'],
       ['1/4/2017', nan, 9.0, 'Sunny'],
       ['1/5/2017', 28.0, nan, 'Snow'],
       ['1/6/2017', nan, 7.0, nan],
       ['1/7/2017', 32.0, nan, 'Rain'],
       ['1/8/2017', nan, nan, 'Sunny'],
       ['1/9/2017', nan, nan, nan],
       ['1/10/2017', 34.0, 8.0, 'Cloudy'],
       ['1/11/2017', 40.0, 12.0, 'Sunny']], dtype=object)

In [55]:
p.index

RangeIndex(start=0, stop=9, step=1)

In [57]:
p.dtypes

day             object
temperature    float64
windspeed      float64
event           object
dtype: object

In [61]:
p.ndim

2

In [63]:
p.shape

(9, 4)

In [25]:
#################### sorting values ##############################################

import pandas as pd

pokemon=pd.read_csv("pokemon.csv",usecols=['Pokemon'],squeeze=True)
pokemon

0       Bulbasaur
1         Ivysaur
2        Venusaur
3      Charmander
4      Charmeleon
5       Charizard
6        Squirtle
7       Wartortle
8       Blastoise
9        Caterpie
10        Metapod
11     Butterfree
12         Weedle
13         Kakuna
14       Beedrill
15         Pidgey
16      Pidgeotto
17        Pidgeot
18        Rattata
19       Raticate
20        Spearow
21         Fearow
22          Ekans
23          Arbok
24        Pikachu
25         Raichu
26      Sandshrew
27      Sandslash
28        Nidoran
29       Nidorina
          ...
691     Clauncher
692     Clawitzer
693    Helioptile
694     Heliolisk
695        Tyrunt
696     Tyrantrum
697        Amaura
698       Aurorus
699       Sylveon
700      Hawlucha
701       Dedenne
702       Carbink
703         Goomy
704       Sliggoo
705        Goodra
706        Klefki
707      Phantump
708     Trevenant
709     Pumpkaboo
710     Gourgeist
711      Bergmite
712       Avalugg
713        Noibat
714       Noivern
715       Xerneas
716       Yveltal
717       Zygarde
718       Diancie
719         Hoopa
720     Volcanion
Name: Pokemon, Length: 721, dtype: object

In [26]:
pokemon.sort_values()

459     Abomasnow
62           Abra
358         Absol
616      Accelgor
680     Aegislash
141    Aerodactyl
305        Aggron
189         Aipom
64       Alakazam
593     Alomomola
333       Altaria
697        Amaura
423       Ambipom
590     Amoonguss
180      Ampharos
346       Anorith
23          Arbok
58       Arcanine
492        Arceus
565        Archen
566      Archeops
167       Ariados
347       Armaldo
682    Aromatisse
303          Aron
143      Articuno
530        Audino
698       Aurorus
712       Avalugg
609          Axew
          ...
69     Weepinbell
109       Weezing
546    Whimsicott
543    Whirlipede
339      Whiscash
292       Whismur
39     Wigglytuff
277       Wingull
201     Wobbuffet
526        Woobat
193        Wooper
412      Wormadam
264       Wurmple
359        Wynaut
177          Xatu
715       Xerneas
561        Yamask
192         Yanma
468       Yanmega
716       Yveltal
334      Zangoose
144        Zapdos
522     Zebstrika
643        Zekrom
262     Zigzagoon
570       Zoroark
569         Zorua
40          Zubat
633      Zweilous
717       Zygarde
Name: Pokemon, Length: 721, dtype: object

In [27]:
pokemon.sort_values().head(10)

459     Abomasnow
62           Abra
358         Absol
616      Accelgor
680     Aegislash
141    Aerodactyl
305        Aggron
189         Aipom
64       Alakazam
593     Alomomola
Name: Pokemon, dtype: object

In [28]:
pokemon.sort_values(ascending=False).head(6)

717      Zygarde
633     Zweilous
40         Zubat
569        Zorua
570      Zoroark
262    Zigzagoon
Name: Pokemon, dtype: object

In [29]:
pokemon.sort_index(ascending=False).head(10)

720    Volcanion
719        Hoopa
718      Diancie
717      Zygarde
716      Yveltal
715      Xerneas
714      Noivern
713       Noibat
712      Avalugg
711     Bergmite
Name: Pokemon, dtype: object

In [13]:
#using dataframe

abc=pd.DataFrame({'a' :[1,2,3,4], 'b' :['mango','rohit','mohit','roni']})
abc

   a      b
0  1  mango
1  2  rohit
2  3  mohit
3  4   roni

In [44]:
abc[1:3]

   a      b
1  2  rohit
2  3  mohit

In [14]:
abc['a']

0    1
1    2
2    3
3    4
Name: a, dtype: int64

In [80]:
p

         day  temperature  windspeed   event
0   1/1/2017         32.0        6.0    Rain
1   1/4/2017          NaN        9.0   Sunny
2   1/5/2017         28.0        NaN    Snow
3   1/6/2017          NaN        7.0     NaN
4   1/7/2017         32.0        NaN    Rain
5   1/8/2017          NaN        NaN   Sunny
6   1/9/2017          NaN        NaN     NaN
7  1/10/2017         34.0        8.0  Cloudy
8  1/11/2017         40.0       12.0   Sunny

In [61]:
p.loc[0:5,['day','event']]

        day  event
0  1/1/2017   Rain
1  1/4/2017  Sunny
2  1/5/2017   Snow
3  1/6/2017    NaN
4  1/7/2017   Rain
5  1/8/2017  Sunny

In [65]:
p.iloc[1:3,:-1]

        day  temperature  windspeed
1  1/4/2017          NaN        9.0
2  1/5/2017         28.0        NaN

In [101]:
#### value counts ###############
pokemon.value_counts()

Tranquill     1
Bunnelby      1
Jumpluff      1
Alakazam      1
Azelf         1
Lotad         1
Furfrou       1
Meganium      1
Froakie       1
Onix          1
Golbat        1
Swinub        1
Horsea        1
Vigoroth      1
Grovyle       1
Vaporeon      1
Chikorita     1
Purrloin      1
Vespiquen     1
Duskull       1
Cinccino      1
Typhlosion    1
Skiddo        1
Zubat         1
Cofagrigus    1
Aron          1
Lileep        1
Hoppip        1
Weepinbell    1
Ampharos      1
             ..
Munchlax      1
Lillipup      1
Emboar        1
Natu          1
Plusle        1
Weavile       1
Charmeleon    1
Floette       1
Diancie       1
Eelektross    1
Spinda        1
Reshiram      1
Rapidash      1
Yanma         1
Hitmontop     1
Vivillon      1
Celebi        1
Swirlix       1
Lampent       1
Cherrim       1
Shiftry       1
Deoxys        1
Fennekin      1
Primeape      1
Slakoth       1
Conkeldurr    1
Tyrunt        1
Bergmite      1
Sandshrew     1
Starmie       1
Name: Pokemon, Length: 721, dtype: int64

In [109]:
p=pd.read_csv("weather_data.csv",usecols=['event'],squeeze=True)
p

0      Rain
1     Sunny
2      Snow
3       NaN
4      Rain
5     Sunny
6       NaN
7    Cloudy
8     Sunny
Name: event, dtype: object

In [110]:
p.value_counts()

Sunny     3
Rain      2
Cloudy    1
Snow      1
Name: event, dtype: int64

In [111]:
p.value_counts(ascending=True)

Snow      1
Cloudy    1
Rain      2
Sunny     3
Name: event, dtype: int64

In [116]:
p=pd.read_csv("weather_data.csv",usecols=['temperature'],squeeze=True)


def fun(num): 
  
    if num <32.0: 
        return "Low"
  
    elif num>= 32 and num<40.0: 
        return "Normal"
  
    else: 
        return "High"


p.apply(fun)

0    Normal
1      High
2       Low
3      High
4    Normal
5      High
6      High
7    Normal
8      High
Name: temperature, dtype: object

In [15]:
################### Adding new coloumn to dataframe #########################

p=pd.read_csv('weather_data.csv')
p

         day  temperature  windspeed   event
0   1/1/2017         32.0        6.0    Rain
1   1/4/2017          NaN        9.0   Sunny
2   1/5/2017         28.0        NaN    Snow
3   1/6/2017          NaN        7.0     NaN
4   1/7/2017         32.0        NaN    Rain
5   1/8/2017          NaN        NaN   Sunny
6   1/9/2017          NaN        NaN     NaN
7  1/10/2017         34.0        8.0  Cloudy
8  1/11/2017         40.0       12.0   Sunny

In [16]:
p['kaushal']=['imhotman','handsome','cool','chill','charming','pro','topper','hacker','trainer']
p

         day  temperature  windspeed   event   kaushal
0   1/1/2017         32.0        6.0    Rain  imhotman
1   1/4/2017          NaN        9.0   Sunny  handsome
2   1/5/2017         28.0        NaN    Snow      cool
3   1/6/2017          NaN        7.0     NaN     chill
4   1/7/2017         32.0        NaN    Rain  charming
5   1/8/2017          NaN        NaN   Sunny       pro
6   1/9/2017          NaN        NaN     NaN    topper
7  1/10/2017         34.0        8.0  Cloudy    hacker
8  1/11/2017         40.0       12.0   Sunny   trainer

In [17]:
p.insert(2, column="aunty", value="fool")
p

         day  temperature aunty  windspeed   event   kaushal
0   1/1/2017         32.0  fool        6.0    Rain  imhotman
1   1/4/2017          NaN  fool        9.0   Sunny  handsome
2   1/5/2017         28.0  fool        NaN    Snow      cool
3   1/6/2017          NaN  fool        7.0     NaN     chill
4   1/7/2017         32.0  fool        NaN    Rain  charming
5   1/8/2017          NaN  fool        NaN   Sunny       pro
6   1/9/2017          NaN  fool        NaN     NaN    topper
7  1/10/2017         34.0  fool        8.0  Cloudy    hacker
8  1/11/2017         40.0  fool       12.0   Sunny   trainer

In [161]:
################### mising values #################################3

p=pd.read_csv('weather_data.csv')
p.dropna()

         day  temperature  windspeed   event
0   1/1/2017         32.0        6.0    Rain
7  1/10/2017         34.0        8.0  Cloudy
8  1/11/2017         40.0       12.0   Sunny